In [1]:
import numpy as np
import pandas as pd

In [2]:
detail={'Name':['Ibrahim Musa','Emeka Jude','Emmanuel Ayomide','Nnamdi Ike'],
        'Age':[24,25,27,24],
        'Course':['Physics','Statistic','Mathematics','Chemistry'],
        'Sport':['Football','Volleyball','Swimming','Basketball'],
        'Amount':['#20000','#25000','#20000','#20200']
       }

In [3]:
df=pd.DataFrame(detail)

In [4]:
df

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football  #20000
1        Emeka Jude   25    Statistic  Volleyball  #25000
2  Emmanuel Ayomide   27  Mathematics    Swimming  #20000
3        Nnamdi Ike   24    Chemistry  Basketball  #20200

In [5]:
df['Name'].str.lower()

0        ibrahim musa
1          emeka jude
2    emmanuel ayomide
3          nnamdi ike
Name: Name, dtype: object

In [6]:
df['Name'].str.upper()

0        IBRAHIM MUSA
1          EMEKA JUDE
2    EMMANUEL AYOMIDE
3          NNAMDI IKE
Name: Name, dtype: object

In [7]:
df['Name'].str.islower()

0    False
1    False
2    False
3    False
Name: Name, dtype: bool

In [8]:
df['Name'].str.isupper()

0    False
1    False
2    False
3    False
Name: Name, dtype: bool

In [9]:
df['Name'].str.upper().str.isupper()

0    True
1    True
2    True
3    True
Name: Name, dtype: bool

In [10]:
df['Name'].str.lower().str.islower()

0    True
1    True
2    True
3    True
Name: Name, dtype: bool

In [11]:
df['Name'].str.swapcase()

0        iBRAHIM mUSA
1          eMEKA jUDE
2    eMMANUEL aYOMIDE
3          nNAMDI iKE
Name: Name, dtype: object

In [12]:
df['Course'].str.upper()

0        PHYSICS
1      STATISTIC
2    MATHEMATICS
3      CHEMISTRY
Name: Course, dtype: object

In [13]:
# How to strim and remove characters from a string literal

### Splitting and Replacing
- cat -Concatenates the series index element with given separator
- Split- Splits each string with the given pattern
- Replace -Replaces a value with another value

In [14]:
df['Name'].str.cat(sep='_')

'Ibrahim Musa_Emeka Jude_Emmanuel Ayomide_Nnamdi Ike'

In [15]:
'We are learning Pandas'.split(" ")

['We', 'are', 'learning', 'Pandas']

In [16]:
df['Name'].str.split(' ')

0        [Ibrahim, Musa]
1          [Emeka, Jude]
2    [Emmanuel, Ayomide]
3          [Nnamdi, Ike]
Name: Name, dtype: object

In [17]:
df['Name'].str.split(' ').str.get(0)

0     Ibrahim
1       Emeka
2    Emmanuel
3      Nnamdi
Name: Name, dtype: object

In [18]:
df[['First Name','Last Name']]=df['Name'].str.split(' ',expand=True)

In [19]:
df

               Name  Age       Course       Sport  Amount First Name Last Name
0      Ibrahim Musa   24      Physics    Football  #20000    Ibrahim      Musa
1        Emeka Jude   25    Statistic  Volleyball  #25000      Emeka      Jude
2  Emmanuel Ayomide   27  Mathematics    Swimming  #20000   Emmanuel   Ayomide
3        Nnamdi Ike   24    Chemistry  Basketball  #20200     Nnamdi       Ike

####  Converting a String literal with symbols to a float, int, double, and ...

In [20]:
df['Amount'].str.replace('#','').astype

<bound method NDFrame.astype of 0    20000
1    25000
2    20000
3    20200
Name: Amount, dtype: object>

In [21]:
df['Name'].str.lower().str.count('m')

0    2
1    1
2    3
3    1
Name: Name, dtype: int64

In [26]:
df['Amount'].str.replace('#','').astype(float).sum()

85200.0

In [27]:
df['Name'].str.lower().str.endswith('e')

0    False
1     True
2     True
3     True
Name: Name, dtype: bool

In [28]:
df['Name'].str.lower().str.find('m')

0    6
1    1
2    1
3    3
Name: Name, dtype: int64

In [29]:
df['Name'].str.lower().str.findall('m')

0       [m, m]
1          [m]
2    [m, m, m]
3          [m]
Name: Name, dtype: object

In [30]:
df=pd.read_csv('students.csv')

In [31]:
df

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
2,Sesan Obi,24,Swimming,67.0,95.0,71.0
3,Kevin Frank,25,Tennis,53.0,85.0,74.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0
5,Caroline Obi,27,Basketball,92.0,71.0,79.0
6,Franklin Oladele,18,Football,96.0,NaN,70.0
7,Kola Ola,28,Swimming,82.0,95.0,58.0
8,Emmanuel Ovi,23,Tennis,79.0,61.0,68.0
9,Kareem Musa,24,Football,78.0,73.0,86.0
10,Mustapha Ahmed,24,NaN,88.0,84.0,NaN
11,Femi Akin,24,Tennis,90.0,97.0,85.0
12,Tobi Olaniyan,22,Volleyball,51.0,79.0,84.0
13,Kayode Ibrahim,25,Football,58.0,67.0,84.0
14,Nnamdi Ike,26,Swimming,NaN,62.0,88.0
15,Ahmed Musa,24,Football,60.0,90.0,81.0
16,Kevin Frank,25,Tennis,53.0,85.0,74.0
17,Susan James,27,Volleyball,76.0,69.0,54.0
18,Zainab Mohammed,25,Basketball,64.0,95.0,94.0
19,Sesan Obi,26,Swimming,67.0,95.0,71.0

In [32]:
department=df.groupby('sport')

In [33]:
type(department)

pandas.core.groupby.generic.DataFrameGroupBy

In [34]:
department.groups

{'Basketball': [4, 5, 18], 'Football': [0, 1, 6, 9, 13, 15], 'Swimming': [2, 7, 14, 19], 'Tennis': [3, 8, 11, 16], 'Volleyball': [12, 17]}

In [42]:
df.loc[11]

name             Femi Akin
age                     24
sport               Tennis
Biology_score         90.0
Maths_score           97.0
English_score         85.0
Name: 11, dtype: object

In [55]:
df['sport'].nunique()

5

In [50]:
department.get_group('Football')

                name  age     sport  Biology_score  Maths_score  English_score
0   Emmanuel Ayomide   27  Football           73.0         58.0           65.0
1       Ibrahim Musa   24  Football           92.0         56.0           80.0
6   Franklin Oladele   18  Football           96.0          NaN           70.0
9        Kareem Musa   24  Football           78.0         73.0           86.0
13    Kayode Ibrahim   25  Football           58.0         67.0           84.0
15        Ahmed Musa   24  Football           60.0         90.0           81.0

In [54]:
department.get_group('Volleyball')

             name  age       sport  Biology_score  Maths_score  English_score
12  Tobi Olaniyan   22  Volleyball           51.0         79.0           84.0
17    Susan James   27  Volleyball           76.0         69.0           54.0

In [56]:
department.size()

sport
Basketball    3
Football      6
Swimming      4
Tennis        4
Volleyball    2
dtype: int64

In [57]:
# How to get the group element

In [58]:
department.get_group('Basketball')

,name,age,sport,Biology_score,Maths_score,English_score
4,Emeka Jude,24,Basketball,86.0,80.0,93.0
5,Caroline Obi,27,Basketball,92.0,71.0,79.0
18,Zainab Mohammed,25,Basketball,64.0,95.0,94.0

In [59]:
department.get_group('Tennis')

            name  age   sport  Biology_score  Maths_score  English_score
3    Kevin Frank   25  Tennis           53.0         85.0           74.0
8   Emmanuel Ovi   23  Tennis           79.0         61.0           68.0
11     Femi Akin   24  Tennis           90.0         97.0           85.0
16   Kevin Frank   25  Tennis           53.0         85.0           74.0

In [ ]:
new_column=